#pragma once

/*
*	制作状況
*	2021/02/05（金）	次やるとこはkeyPressCountねおｋ？
* 
*	font-size:	10px;
*	widht:		240px;
*	height:		66px;
*/

/*
*	▽「状態遷移」
*		▪タイトル
*		▪メニュー
*		▪ゲームスタート
*			└ゲームクリア		ーリザルト
*			└ゲームオーバー	ーゲームオーバー画面	ーリザルト
*/

/*
*		▽「ゲームシステム」
* 
*			▪プレイヤーは右クリック時に移動する
*				└プレイヤーとマウスカーソルの位置判定
*
*			▪プレイヤーの頭に当たると体の一部を失う
*				└最低３回当たると敗北
*					└体の長さ最長は「１０」
*
*			▪プレイヤーの体はアイテムによって増える
* 
* 
*		▽「背景」、「グラフィック」
*			
*			▪また、ファイルを読み込む
*				└群馬県
* 
*				└障害物	ー色固定	ー
* 
*							ー空き缶
*							ー魚
*							ーうんこ	ーetc...
* 
*				└アイテム	ー色固定	ー
* 
*			▪背景	ー川、海
*					ー
*			
*			▪プレイヤー		チン・ア・ナ魚―スター
*			
* 
*/

